avrxml/asf/thirdparty/wireless/avr2025_mac/apps/mac/no_beacon/dev/app_security.c
			wpan_mlme_set_req(macKeyTable,
					INDEX_1,            /* Index: 1 */
					&mac_key_table2);
		}
		break;

		case INDEX_1:
		{
			uint8_t mac_key_table3[43] = {
				/* KeyIdLookupList[1].LookupData :
				 * macDefaultKeySource || g_Sec_KeyIndex_1 */
				default_key_source[0],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[0]
						                        **/
				default_key_source[1],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[1]
						                        **/
				default_key_source[2],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[2]
						                        **/
				default_key_source[3],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[3]
						                        **/
				default_key_source[4],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[4]
						                        **/
				default_key_source[5],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[5]
						                        **/
				default_key_source[6],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[6]
						                        **/
				default_key_source[7],                 /*
						                        *
						                        *
						                        *
						                        *LookupData[7]
						                        **/
				KEY_INDEX_3,                           /*
						                        *
						                        *
						                        *
						                        *LookupData[8]
						                        **/
				LOOKUP_DATA_SIZE_1,                 /*
						                     *
						                     *
						                     *
						                     *LookupDataSize:
						                     * 0x01 :
						                     * Size 9
						                     * octets */
				MAC_ZIP_MAX_KEY_ID_LOOKUP_LIST_ENTRIES,                 /*
						                                         *
						                                         *
						                                         *
						                                         *KeyIdLookupListEntries
						                                         *
						                                         *=
						                                         *
						                                         *
						                                         *
						                                         *1
						                                         **/
				/* KeyDeviceList[1] */
				EMPTY_DEV_HANDLE,                 /*
						                   *
						                   *
						                   *
						                   *DeviceDescriptorHandle
						                   **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *UniqueDevice
						                     **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *Blacklisted
						                     **/
				EMPTY_DEV_HANDLE,                 /*
						                   *
						                   *
						                   *
						                   *DeviceDescriptorHandle
						                   **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *UniqueDevice
						                     **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *Blacklisted
						                     **/
				EMPTY_DEV_HANDLE,                 /*
						                   *
						                   *
						                   *
						                   *DeviceDescriptorHandle
						                   **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *UniqueDevice
						                     **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *Blacklisted
						                     **/
				EMPTY_DEV_HANDLE,                           /*
						                             *
						                             *
						                             *
						                             *DeviceDescriptorHandle
						                             **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *UniqueDevice
						                     **/
				false,                              /*
						                     *
						                     *
						                     *
						                     *Blacklisted
						                     **/
				MAC_ZIP_MAX_KEY_DEV_LIST_ENTRIES,                 /*
						                                   *
						                                   *
						                                   *
						                                   *KeyDeviceListEntries
						                                   **/
				/*  KeyUsageList */
				FRAME_TYPE_DATA,                    /* FrameType
						                     * - Data
						                     * frames */
				CMD_FRAME_ID_NA,                    /*
						                     *
						                     *
						                     *
						                     *CommandFrameIdentifier
						                     * not used
						                     * in ZIP */
				MAC_ZIP_MAX_KEY_USAGE_LIST_ENTRIES,                 /*
						                                     *
						                                     *
						                                     *
						                                     *KeyUsageListEntries
						                                     **/
				/* Key */
				default_key[2][0],
				default_key[2][1],
				default_key[2][2],
				default_key[2][3],
				default_key[2][4],
				default_key[2][5],
				default_key[2][6],
				default_key[2][7],
				default_key[2][8],
				default_key[2][9],
				default_key[2][10],
				default_key[2][11],
				default_key[2][12],
				default_key[2][13],
				default_key[2][14],
				default_key[2][15],
			};
			wpan_mlme_set_req(macKeyTable,
					INDEX_2,                            /*
					                                     *
					                                     *
					                                     *
					                                     *Index:
					                                     * 2
					                                     **/
					&mac_key_table3);
		}
		break;

		case INDEX_2:
		{
			uint8_t coord_dev_index = 3;
			uint8_t mac_dev_table[17];

			mac_dev_table[0] = (uint8_t)DEFAULT_PAN_ID;
			mac_dev_table[1] = (uint8_t)(DEFAULT_PAN_ID >> 8);
			mac_dev_table[2] = (uint8_t)COORD_SHORT_ADDR;
			mac_dev_table[3] = (uint8_t)(COORD_SHORT_ADDR >> 8);
			mac_dev_table[4] =  COORD_IEEE_ADDRESS[7];
			mac_dev_table[5] =  COORD_IEEE_ADDRESS[6];
			mac_dev_table[6] =  COORD_IEEE_ADDRESS[5];
			mac_dev_table[7] =  COORD_IEEE_ADDRESS[4];
			mac_dev_table[8] =  COORD_IEEE_ADDRESS[3];
			mac_dev_table[9] =  COORD_IEEE_ADDRESS[2];
			mac_dev_table[10] = COORD_IEEE_ADDRESS[1];
			mac_dev_table[11] = COORD_IEEE_ADDRESS[0];
			mac_dev_table[12] = 0;                  /* Frame counter
					                        **/
			mac_dev_table[13] = 0;
			mac_dev_table[14] = 0;
			mac_dev_table[15] = 0;
			mac_dev_table[16] = 0;                  /* Exempt */

			wpan_mlme_set_req(macDeviceTable,
					coord_dev_index,                                            /*
					                                                             *
					                                                             *
					                                                             *
					                                                             *Index
					                                                             **/
					&mac_dev_table);
		}
		break;

		default:
			break;
		}
	}
	break;

